# 6-5. 파생변수 추가하기

<img src='./data/01.png'>

## dplyr
- 데이터 전처리 패키지


<img src='./data/02.png'>

In [1]:
library(dplyr)

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [2]:
exam1 <- read.csv("./data/csv_exam.csv")
head(exam1)

exam1 %>% 
    mutate(total = math + english + science) %>%
    head

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78
4 4  1     30   98      58
5 5  2     25   80      65
6 6  2     50   89      98

  id class math english science total
1 1  1     50   98      50      198
2 2  1     60   97      60      217
3 3  1     45   86      78      209
4 4  1     30   98      58      186
5 5  2     25   80      65      170
6 6  2     50   89      98      237

In [3]:
exam2 <- read.csv("./data/csv_exam.csv")
head(exam2)

head(mutate(exam2, total = math + english + science))

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78
4 4  1     30   98      58
5 5  2     25   80      65
6 6  2     50   89      98

  id class math english science total
1 1  1     50   98      50      198
2 2  1     60   97      60      217
3 3  1     45   86      78      209
4 4  1     30   98      58      186
5 5  2     25   80      65      170
6 6  2     50   89      98      237

## 여러 파생변수 한 번에 추가하기

In [4]:
exam1 %>% 
    mutate(total = math + english + science,
          mean = (math + english + science)/3) %>% 
    head

  id class math english science total mean
1 1  1     50   98      50      198   66.00000
2 2  1     60   97      60      217   72.33333
3 3  1     45   86      78      209   69.66667
4 4  1     30   98      58      186   62.00000
5 5  2     25   80      65      170   56.66667
6 6  2     50   89      98      237   79.00000

In [5]:
exam1 %>% 
    mutate(total = math + english + science,
          mean = total/3) %>% 
    head

  id class math english science total mean
1 1  1     50   98      50      198   66.00000
2 2  1     60   97      60      217   72.33333
3 3  1     45   86      78      209   69.66667
4 4  1     30   98      58      186   62.00000
5 5  2     25   80      65      170   56.66667
6 6  2     50   89      98      237   79.00000

### mutate() 와 ifelse() 적용하기

In [6]:
exam1 %>%
    mutate(test = ifelse(science >= 60, "pass", "fail")) %>% 
    head

  id class math english science test
1 1  1     50   98      50      fail
2 2  1     60   97      60      pass
3 3  1     45   86      78      pass
4 4  1     30   98      58      fail
5 5  2     25   80      65      pass
6 6  2     50   89      98      pass

### 추가한 변수를 `dplyr` 코드에 바로 활용하기

In [7]:
exam1 %>%  
    mutate(total = math + english + science) %>% 
    arrange(total) %>% 
    head

  id class math english science total
1  9 3     20   98      15      133
2 14 4     48   87      12      147
3 12 3     45   85      32      162
4  5 2     25   80      65      170
5  4 1     30   98      58      186
6  8 2     90   78      25      193

# 6-6. 집단별로 요약하기
- summarise
- group_by
<img src='./data/03.png'>

### 요약하기

In [8]:
# summarise
exam1 %>% summarise(mean_math=mean(math))

  mean_math
1 57.45

### 집단별로 요약하기

In [9]:
# group_by, summarise
exam1 %>% 
    group_by(class) %>% 
    summarise(mean_math = mean(math))

  class mean_math
1 1     46.25
2 2     61.25
3 3     45.00
4 4     56.75
5 5     78.00

### 여러 요약통계량 한번에 산출하기

In [10]:
exam1  %>% 
    group_by(class) %>% 
    summarise(mean_math = mean(math),
              sum_math = sum(math),
              median_math = median(math),
              n = n())

  class mean_math sum_math median_math n
1 1     46.25     185      47.5        4
2 2     61.25     245      65.0        4
3 3     45.00     180      47.5        4
4 4     56.75     227      53.0        4
5 5     78.00     312      79.0        4

### 각 집단별로 다시 집단 나누기

In [13]:
mpg <- as.data.frame(ggplot2::mpg)
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact

In [14]:
mpg %>% 
    group_by(manufacturer, drv) %>% 
    summarise(mean_cty = mean(cty)) %>% 
    head(10)

   manufacturer drv mean_cty
1  audi         4   16.81818
2  audi         f   18.85714
3  chevrolet    4   12.50000
4  chevrolet    f   18.80000
5  chevrolet    r   14.10000
6  dodge        4   12.00000
7  dodge        f   15.81818
8  ford         4   13.30769
9  ford         r   14.75000
10 honda        f   24.44444

### dplyr 조합하기
* mpg 데이터 이용.

#### 1. 회사별로 분리 -> group_by
#### 2. suv 추출 -> filter
#### 3. 통합 연비 변수 생성 -> mutate
#### 4. 통합 연비 평균 산출 -> summarise
#### 5. 내림차순 정렬 -> arrange
#### 6. 1~5위까지 출력 -> head

In [15]:
mpg %>% 
    group_by(manufacturer) %>% 
    filter(class=='suv') %>% 
    mutate(tot = (cty+hwy)/2) %>% 
    summarise(mean_tot = mean(tot)) %>% 
    arrange(desc(mean_tot)) %>% 
    head(5)

  manufacturer mean_tot
1 subaru       21.91667
2 toyota       16.31250
3 nissan       15.87500
4 mercury      15.62500
5 jeep         15.56250

# 6-7 데이터 합치기

<img src='./data/04.png'>

## 가로로 합치기

In [16]:
test1 <- data.frame(id = c(1, 2, 3, 4, 5),
midterm = c(60, 80, 70, 90, 85))
test1

test2 <- data.frame(id = c(1, 2, 3, 4, 5),
final = c(70, 83, 65, 95, 80))
test2

  id midterm
1 1  60
2 2  80
3 3  70
4 4  90
5 5  85

  id final
1 1  70
2 2  83
3 3  65
4 4  95
5 5  80

In [17]:
total <- left_join(test1, test2, by = "id")
total

  id midterm final
1 1  60      70
2 2  80      83
3 3  70      65
4 4  90      95
5 5  85      80

###  다른 데이터 활용해 변수 추가하기

In [18]:
name <- data.frame(class = c(1, 2, 3, 4, 5),
teacher = c("kim", "lee", "park", "choi", "jung"))
name

  class teacher
1 1     kim
2 2     lee
3 3     park
4 4     choi
5 5     jung

In [19]:
exam1 <- read.csv("./data/csv_exam.csv")
exam_new <- left_join(exam1, name, by = "class")
exam_new

   id class math english science teacher
1   1 1     50   98      50      kim
2   2 1     60   97      60      kim
3   3 1     45   86      78      kim
4   4 1     30   98      58      kim
5   5 2     25   80      65      lee
6   6 2     50   89      98      lee
7   7 2     80   90      45      lee
8   8 2     90   78      25      lee
9   9 3     20   98      15      park
10 10 3     50   98      45      park
11 11 3     65   65      65      park
12 12 3     45   85      32      park
13 13 4     46   98      65      choi
14 14 4     48   87      12      choi
15 15 4     75   56      78      choi
16 16 4     58   98      65      choi
17 17 5     65   68      98      jung
18 18 5     80   78      90      jung
19 19 5     89   68      87      jung
20 20 5     78   83      58      jung

## 세로로 합치기

In [20]:
group_a <- data.frame(id = c(1, 2, 3, 4, 5),
test = c(60, 80, 70, 90, 85))
group_a

group_b <- data.frame(id = c(6, 7, 8, 9, 10),
test = c(70, 83, 65, 95, 80))
group_b

  id test
1 1  60
2 2  80
3 3  70
4 4  90
5 5  85

  id test
1  6 70
2  7 83
3  8 65
4  9 95
5 10 80

In [21]:
group_all <- bind_rows(group_a, group_b)
group_all

   id test
1   1 60
2   2 80
3   3 70
4   4 90
5   5 85
6   6 70
7   7 83
8   8 65
9   9 95
10 10 80

# 정리하기


## 1.조건에 맞는 데이터만 추출하기
```r
exam %>% 
    filter(english >= 80)

# 여러 조건 동시 충족
exam %>% 
    filter(class == 1 & math >= 50)

# 여러 조건 중 하나 이상 충족
exam %>% 
    filter(math >= 90 | english >= 90) exam %>% 
    filter(class %in% c(1,3,5))
```

## 2.필요한 변수만 추출하기
```r
exam %>% 
    select(math)
exam %>% 
    select(class, math, english)
```

## 3.함수 조합하기, 일부만 출력하기
```r
exam %>%
    select(id, math) %>% 
    head(10)
```

## 4.순서대로 정렬하기

```r
exam %>% 
    arrange(math) # 오름차순 정렬

exam %>% 
    arrange(desc(math)) # 내림차순 정렬

exam %>% 
    arrange(class, math) # 여러 변수 기준 오름차순 정렬
```

## 5.파생변수 추가하기
```r
exam %>% 
    mutate(total = math + english + science) # 여러 파생변수 한 번에 추가하기

exam %>%
    mutate(total = math + english + science, mean = (math + english + science)/3) # mutate()에 ifelse() 적용하기

exam %>% 
    mutate(test = ifelse(science >= 60, "pass", "fail")) # 추가한 변수를 dplyr 코드에 바로 활용하기

exam %>%
    mutate(total = math + english + science) %>%
    arrange(total)
```

## 6.집단별로 요약하기
```r
exam %>%
    group_by(class) %>% 
    summarise(mean_math = mean(math))

# 각 집단별로 다시 집단 나누기
mpg %>%
    group_by(manufacturer, drv) %>% 
    summarise(mean_cty = mean(cty))
```

## 7.데이터 합치기 
```r
# 가로로 합치기
total <- left_join(test1, test2, by = "id")

# 세로로 합치기
group_all <- bind_rows(group_a, group_b)
```